gradhocJcalvo/optee-graddeck/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp2/fw/config_all.c
                /* Set SCMI reset domains array for the SCMI agent */
                dev = fwk_mm_calloc(channel_cfg->reset_count, sizeof(*dev));

                fwk_assert(!scmi_reset_agent_tbl[agent_index].device_table);
                scmi_reset_agent_tbl[agent_index].agent_domain_count = channel_cfg->reset_count;
                scmi_reset_agent_tbl[agent_index].device_table = dev;

                /* Set reset_domain and optee/reset elements and config data */
                for (k = 0; k < channel_cfg->reset_count; k++) {
                    struct scmi_reset *reset_cfg = channel_cfg->reset + k;

                    dev[k].element_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_RESET_DOMAIN,
                                                      reset_index);

                    optee_reset_data[reset_index].rstctrl = reset_cfg->rstctrl;

                    optee_reset_elt[reset_index].name = reset_cfg->name;
                    optee_reset_elt[reset_index].data =
                        (void *)(optee_reset_data + reset_index);

                    reset_data[reset_index] = (struct mod_reset_domain_dev_config){
                        .driver_id =
                            (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_RESET,
                                                          reset_index),
                        .driver_api_id =
                            (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_RESET, 0),
                        .modes = MOD_RESET_DOMAIN_AUTO_RESET |
                                 MOD_RESET_DOMAIN_MODE_EXPLICIT_ASSERT |
                                 MOD_RESET_DOMAIN_MODE_EXPLICIT_DEASSERT,
                    };

                    reset_elt[reset_index].name = reset_cfg->name;
                    reset_elt[reset_index].data = (void *)(reset_data + reset_index);

                    reset_index++;
                }

                scpfw_resource_counter.reset_index = reset_index;
            }
#endif

#ifdef CFG_SCPFW_MOD_VOLTAGE_DOMAIN
            if (channel_cfg->voltd_count) {
                size_t regu_index = scpfw_resource_counter.regu_index;
                struct mod_scmi_voltd_device *dev = NULL;

                /* Set SCMI voltage domains array for the SCMI agent */
                dev = fwk_mm_calloc(channel_cfg->voltd_count,
                                    sizeof(struct mod_scmi_voltd_device));

                fwk_assert(!scmi_voltd_agent_tbl[agent_index].device_table);
                scmi_voltd_agent_tbl[agent_index].domain_count = channel_cfg->voltd_count;
                scmi_voltd_agent_tbl[agent_index].device_table = dev;

                /* Set voltage_domain and optee/regu elements and config data */
                for (k = 0; k < channel_cfg->voltd_count; k++) {
                    struct scmi_voltd *voltd_cfg = channel_cfg->voltd + k;
                    static const char reserved[] = "reserved";
                    const char *name = NULL;

                    if (voltd_cfg->regulator) {
                        name = regulator_name(voltd_cfg->regulator);
                    } else {
                        name = reserved;
                    }

                    dev[k].element_id =
                       (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_VOLTAGE_DOMAIN, regu_index);

                    optee_regu_elt[regu_index].name = name;
                    optee_regu_elt[regu_index].data = (void *)(optee_regu_data + regu_index);
                    optee_regu_data[regu_index].regulator = (struct optee_regulator *)voltd_cfg->regulator;
                    optee_regu_data[regu_index].default_enabled = voltd_cfg->enabled;

                    voltd_data[regu_index].driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_VOLTD_REGULATOR,
                                                      regu_index);
                    voltd_data[regu_index].api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_VOLTD_REGULATOR, 0);

                    voltd_elt[regu_index].name = name;
                    voltd_elt[regu_index].data = (void *)(voltd_data + regu_index);
                    regu_index++;
                }

                scpfw_resource_counter.regu_index = regu_index;
            }
#endif

#ifdef CFG_SCPFW_MOD_DVFS
            if (channel_cfg->perfd_count) {
                size_t clock_index = scpfw_resource_counter.clock_index;
                size_t psu_index = scpfw_resource_counter.psu_index;
                size_t dvfs_index = scpfw_resource_counter.dvfs_index;

                for (k = 0; k < channel_cfg->perfd_count; k++) {
                    struct mod_scmi_perf_config *scmi_perf_data = NULL;
                    struct scmi_perfd *perfd_cfg = channel_cfg->perfd + k;

                    /*
                     * DVFS with SCMI performance management domains
                     * 1 initial scmi_perf instance defines the number of DVFS's
                     * For each DVFS instance:
                     * - 1 instance (elt/config) of dvfs, psu, optee/psu, clock, optee/clock
                     * Clocks and optee/clocks are already allocated but not yet set.
                     */

                    /* scmi_perf: data defines the DVFS domains indices */
                    scmi_perf_domain_data[dvfs_index] = (struct mod_scmi_perf_domain_config){ };

                    scmi_perf_data = (void *)config_scmi_perf.data;

                    scmi_perf_data[dvfs_index].domains = (void *)scmi_perf_domain_data;
                    scmi_perf_data[dvfs_index].perf_doms_count = scpfw_resource_counter.dvfs_count;
                    scmi_perf_data[dvfs_index].fast_channels_alarm_id = (fwk_id_t)FWK_ID_NONE_INIT;
#ifdef BUILD_HAS_MOD_STATISTICS
                    scmi_perf_data[dvfs_index].stats_enabled = true;
#endif

                    /* dvfs instances: 1 instance per expose DVFS service */
                    dvfs_data[dvfs_index].psu_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_PSU, psu_index);
                    dvfs_data[dvfs_index].clock_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_CLOCK, clock_index);
                    dvfs_data[dvfs_index].latency = 0; /* not set, used for async access */
                    dvfs_data[dvfs_index].sustained_idx = perfd_cfg->initial_opp;
                    dvfs_data[dvfs_index].opps =
                        fwk_mm_calloc(perfd_cfg->dvfs_opp_count,
                                      sizeof(struct mod_dvfs_opp));

                    for (l = 0; l < perfd_cfg->dvfs_opp_count; l++) {
                        uint64_t power = 0;

