gradhocJcalvo/optee-graddeck/core/lib/scmi-server/SCP-firmware/product/optee-stm32mp2/fw/config_all.c
                        /* Quick estimation of power consumpsion */
                        power = perfd_cfg->dvfs_opp_khz[l];
                        power *= perfd_cfg->dvfs_opp_mv[l];
                        power *= perfd_cfg->dvfs_opp_mv[l];
                        power /= 100 * 1000 * 1000;

                        dvfs_data[dvfs_index].opps[l] = (struct mod_dvfs_opp){
                            .level = perfd_cfg->dvfs_opp_khz[l] * 1000UL,
                            .frequency = perfd_cfg->dvfs_opp_khz[l],
                            .voltage = perfd_cfg->dvfs_opp_mv[l],
                            .power = (uint32_t)power,
                        };
                    }

                    dvfs_elt[dvfs_index].name = perfd_cfg->name;
                    dvfs_elt[dvfs_index].data = (void *)(dvfs_data + dvfs_index);

                    /* Module psu_optee module (elements and  configuration data) */
                    psu_optee_regu_elt[psu_index].name = perfd_cfg->regulator->name;
                    psu_optee_regu_elt[psu_index].sub_element_count = scpfw_resource_counter.psu_count;
                    psu_optee_regu_elt[psu_index].data = (void *)(psu_optee_regu_data + psu_index);

                    psu_optee_regu_data[psu_index].regulator = perfd_cfg->regulator;

                    /* Module psu (elements and  configuration data) */
                    psu_elt[psu_index].name = regulator_name(perfd_cfg->regulator);
                    psu_elt[psu_index].data = (void *)(psu_data + psu_index);
                    psu_data[psu_index].driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, psu_index);
                    psu_data[psu_index].driver_api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_PSU_OPTEE_REGULATOR, 0);

                    /* Module clock and optee_clock */
                    fwk_assert(!clock_elt[clock_index].data);

                    clock_elt[clock_index].name = perfd_cfg->clk->name;
                    clock_elt[clock_index].data = (void *)(clock_data + clock_index);

                    clock_data[clock_index] = (struct mod_clock_dev_config){
                        .driver_id = (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                                   clock_index),
                        .api_id = (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_OPTEE_CLOCK,
                                                            0),
                        .pd_source_id = FWK_ID_NONE,
                    };

                    optee_clock_cfg[clock_index].clk = perfd_cfg->clk;
                    optee_clock_cfg[clock_index].default_enabled = false;

                    optee_clock_elt[clock_index].name = perfd_cfg->clk->name;
                    optee_clock_elt[clock_index].data = (void *)(optee_clock_cfg + clock_index);

                    clock_index++;
                    psu_index++;
                    dvfs_index++;
                }

                scpfw_resource_counter.clock_index = clock_index;
                scpfw_resource_counter.psu_index = psu_index;
                scpfw_resource_counter.dvfs_index = dvfs_index;
            }
#endif

#ifdef CFG_SCPFW_MOD_POWER_DOMAIN
            if (channel_cfg->pd_count) {
                /* System domain */
                size_t system_index = channel_cfg->pd_count; /* Last element */
                struct fwk_element *pd_elt_sys = pd_elt + system_index;
                struct mod_power_domain_element_config *pd_elt_data_sys =
                    fwk_mm_calloc(1, sizeof(*pd_elt_data_sys));
                struct fwk_element *stm32_pd_elt_sys = stm32_pd_elt + system_index;

                /* Data are unused but framework doesn't accept NULL data */
                stm32_pd_elt_sys->name = "system";
                stm32_pd_elt_sys->data = (void *)1;

                pd_elt_sys->name = stm32_pd_elt_sys->name;

                pd_elt_data_sys->parent_idx = PD_STATIC_DEV_IDX_NONE;
                pd_elt_data_sys->driver_id =
                    (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_STM32_PD, system_index);
                pd_elt_data_sys->api_id =
                    (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_STM32_PD, 0);
                pd_elt_data_sys->attributes.pd_type = MOD_PD_TYPE_DEVICE;
                pd_elt_data_sys->allowed_state_mask_table =
                    pd_allowed_state_mask_table;
                pd_elt_data_sys->allowed_state_mask_table_size =
                    FWK_ARRAY_SIZE(pd_allowed_state_mask_table);
                pd_elt_sys->data = pd_elt_data_sys;

                /* Power domains */
                for (k = 0; k < channel_cfg->pd_count; k++) {
                    struct fwk_element *pd_elt_k = pd_elt + k;
                    struct mod_power_domain_element_config *pd_elt_data_k =
                        fwk_mm_calloc(1, sizeof(*pd_elt_data_k));
                    struct fwk_element *stm32_pd_elt_k =
                        stm32_pd_elt + k;
                    struct scmi_pd *scmi_pd = channel_cfg->pd + k;
                    struct mod_stm32_pd_config *mod_stm32_pd_config =
                        fwk_mm_calloc(1, sizeof(*mod_stm32_pd_config));

                    mod_stm32_pd_config->name = scmi_pd->name;
                    mod_stm32_pd_config->clk = scmi_pd->clk;
                    mod_stm32_pd_config->regu = scmi_pd->regu;

                    stm32_pd_elt_k->name = scmi_pd->name;
                    stm32_pd_elt_k->data = (void *)mod_stm32_pd_config;

                    pd_elt_k->name = scmi_pd->name;

                    pd_elt_data_k->parent_idx = system_index;
                    pd_elt_data_k->driver_id =
                        (fwk_id_t)FWK_ID_ELEMENT_INIT(FWK_MODULE_IDX_STM32_PD, k);
                    pd_elt_data_k->api_id =
                        (fwk_id_t)FWK_ID_API_INIT(FWK_MODULE_IDX_STM32_PD, 0);
                    pd_elt_data_k->attributes.pd_type = MOD_PD_TYPE_DEVICE;
                    pd_elt_data_k->allowed_state_mask_table =
                        pd_allowed_state_mask_table;
                    pd_elt_data_k->allowed_state_mask_table_size =
                        FWK_ARRAY_SIZE(pd_allowed_state_mask_table);
                    pd_elt_k->data = pd_elt_data_k;
                }
            }
#endif
        }
    }
}

void scpfw_configure(struct scpfw_config *cfg)
{
    count_resources(cfg);
    allocate_global_resources(cfg);
    set_scmi_comm_resources(cfg);
    set_resources(cfg);
}
